{
    	"-1"	: "an unknown error or an error unrelated to Parse occurred.",
	"1"	: "something has gone wrong with the server. If you get this error code, it is Parse's fault.",
	"100"	: "Error code indicating the connection to the Parse servers failed.",
	"101"	: "Error code indicating the specified object doesn't exist.",
	"102"	: "Error code indicating you tried to query with a datatype that doesn't support it, like exact matching an array or object.",
	"103"	: "Error code indicating a missing or invalid classname. Classnames are case-sensitive. They must start with a letter, and a-zA-Z0-9_ are the only valid characters.",
	"104"	: "Error code indicating an unspecified object id.",
	"105"	: "Error code indicating an invalid key name. Keys are case-sensitive. They must start with a letter, and a-zA-Z0-9_ are the only valid characters.",
	"106"	: "Error code indicating a malformed pointer. You should not see this unless you have been mucking about changing internal Parse code.",
	"107"	: "badly formed JSON was received upstream. This either indicates you have done something unusual with modifying how things encode to JSON, or the network is failing badly.",
	"108"	: "the feature you tried to access is only available internally for testing purposes.",
	"109"	: "You must call Parse.initialize before using the Parse library.",
	"111"	: "a field was set to an inconsistent type.",
	"112"	: "Error code indicating an invalid channel name. A channel name is either an empty string (the broadcast channel) or contains only a-zA-Z0-9_ characters and starts with a letter.",
	"115"	: "push is misconfigured.",
	"116"	: "the object is too large.",
	"119"	: "the operation isn't allowed for clients.",
	"120"	: "Error code indicating the result was not found in the cache.",
	"121"	: "an invalid key was used in a nested JSONObject.",
	"122"	: "an invalid filename was used for ParseFile. A valid file name contains only a-zA-Z0-9_. characters and is between 1 and 128 characters.",
	"123"	: "Error code indicating an invalid ACL was provided.",
	"124"	: "the request timed out on the server. Typically this indicates that the request is too expensive to run.",
	"125"	: "the email address was invalid.",
	"137"	: "a unique field was given a value that is already taken.",
	"139"	: "a role's name is invalid.",
	"140"	: "an application quota was exceeded. Upgrade to resolve.",
	"141"	: "a Cloud Code script failed.",
	"142"	: "a Cloud Code validation failed.",
	"153"	: "deleting a file failed.",
	"155"	: "the application has exceeded its request limit.",
	"160"	: "the provided event name is invalid.",
	"200"	: "the username is missing or empty.",
	"201"	: "the password is missing or empty.",
	"202"	: "the username has already been taken.",
	"203"	: "the email has already been taken.",
	"204"	: "the email is missing, but must be specified.",
	"205"	: "a user with the specified email was not found.",
	"206"	: "a user object without a valid session could not be altered.",
	"207"	: "a user can only be created through signup.",
	"208"	: "an an account being linked is already linked to another user.",
	"209"	: "the current session token is invalid.",
	"250"	: "a user cannot be linked to an account because that account's id could not be found.",
	"251"	: "a user with a linked (e.g. Facebook) account has an invalid session.",
	"252"	: "a service being linked (e.g. Facebook or Twitter) is unsupported."
}